# Week13 - Lab 
## Refresher

* Find averages for both genders

In [6]:
import pandas as pd

In [23]:
df = pd.read_csv('https://raw.githubusercontent.com/msaricaumbc/DS601_Fall21/main/Week13/data/ages.csv', index_col=0)

In [24]:
df.head()

   gender  age
0  Female   51
1    Male   66
2    Male   75
3  Female   72
4    Male   73

In [25]:
df.tail()

      gender  age
1995  Female   62
1996    Male   84
1997  Female   77
1998  Female   68
1999  Female   54

In [45]:
df[df['gender']=='Female']

      gender  age
0     Female   51
3     Female   72
5     Female   74
6     Female   86
7     Female   51
...      ...  ...
1993  Female   78
1995  Female   62
1997  Female   77
1998  Female   68
1999  Female   54

[773 rows x 2 columns]

In [32]:
df['gender'].value_counts()

Female    773
Male      728
male      263
female    236
Name: gender, dtype: int64

In [46]:
df['gender']=df['gender'].str.upper()

In [47]:
df.groupby('gender',as_index=False).age.mean()

   gender        age
0  FEMALE  63.895937
1    MALE  62.265388